иб/src/Catalogs/Заболевания/Заболевания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заболевания</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КодНСС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаразнаяСписок1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаразнаяСписок2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтиологияБолезни</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МерыБорьбы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереносчикиБолезни</name>
    <attributes>
      <name>Переносчик</name>
      <type>
        <types>CatalogRef.ПереносчикиБолезней</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоражаемыеСистемы</name>
    <attributes>
      <name>ПоражаемаяСистема</name>
      <type>
        <types>CatalogRef.ПоражаемыеСистемы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозбудителиБолезни</name>
    <attributes>
      <name>Возбудитель</name>
      <type>
        <types>CatalogRef.Возбудители</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Литература</name>
    <attributes>
      <name>Литература</name>
      <type>
        <types>CatalogRef.Литература</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВетеринарныеМероприятия</name>
    <attributes>
      <name>ВетеринарноеМероприятие</name>
      <type>
        <types>CatalogRef.ОздоровительныеМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрименениеВетПрепаратов</name>
    <attributes>
      <name>ВетеринарныйПрепарат</name>
      <type>
        <types>CatalogRef.Препараты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаКг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПрименения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьПрименения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПризнакиБолезни</name>
    <attributes>
      <name>Признак</name>
      <type>
        <types>CatalogRef.ПризнакиБолезней</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

иб/src/Catalogs/Заболевания/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПризнакиБолезниОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.ПризнакиБолезни.Добавить();
			НоваяСтрока.Признак = Значение.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоражаемыеСистемыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.ПоражаемыеСистемы.Добавить();
			НоваяСтрока.ПоражаемаяСистема = Значение.Ссылка;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВозбудителиБолезниОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.ВозбудителиБолезни.Добавить();
			НоваяСтрока.Возбудитель = Значение.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереносчикиБолезниОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.ПереносчикиБолезни.Добавить();
			НоваяСтрока.Переносчик = Значение.Ссылка;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрименениеВетПрепаратовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.ПрименениеВетПрепаратов.Добавить();
			НоваяСтрока.ВетеринарныйПрепарат = Значение.Ссылка;
			НоваяСтрока.ЕдиницаИзмерения = ВернутьЕдиницуХраненияМатериала (Значение.Ссылка) 
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВетеринарныеМероприятияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.ВетеринарныеМероприятия.Добавить();
			НоваяСтрока.ВетеринарноеМероприятие = Значение.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛитератураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.Литература.Добавить();
			НоваяСтрока.Литература = Значение.Ссылка;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрименениеВетПрепаратовВетеринарныйПрепаратПриИзменении(Элемент)
		ТекДан = ЭтотОбъект.Элементы.ПрименениеВетПрепаратов.ТекущиеДанные;
	если ЗначениеЗаполнено (ТекДан.ВетеринарныйПрепарат) тогда
		ТекДан.ЕдиницаИзмерения = ВернутьЕдиницуХраненияМатериала (ТекДан.ВетеринарныйПрепарат);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВернутьЕдиницуХраненияМатериала (ВетеринарныйПрепарат)
	
	Возврат (ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(ВетеринарныйПрепарат, "ЕдиницаХраненияОстатков"));	
	
КонецФункции

#КонецОбласти

#Область Подбора

&НаКлиенте
Процедура ПодборСистем(Команда)
	СтруктураПараметров = Новый Структура("ВидНазначения, ЗакрыватьПриВыборе, МножественныйВыбор", 
	"ПоражаемыеСистемы", Ложь, Истина);
	ОткрытьФормуМодально("Справочник.сжсвЗаболевания.Форма.ФормаПодбора", СтруктураПараметров, Элементы.ПоражаемыеСистемы);
КонецПроцедуры

&НаКлиенте
Процедура ПодборВетПрепаратов(Команда)
	СтруктураПараметров = Новый Структура("ВидНазначения, ЗакрыватьПриВыборе, МножественныйВыбор", 
	"", Ложь, Истина);
	ОткрытьФормуМодально("Справочник.Заболевания.Форма.ФормаПодбора", СтруктураПараметров, Элементы.ПрименениеВетПрепаратов);
КонецПроцедуры

&НаКлиенте
Процедура ПодборПризнаковБолезни(Команда)
	СтруктураПараметров = Новый Структура("ВидНазначения, ЗакрыватьПриВыборе, МножественныйВыбор", 
	"ПризнакиБолезни", Ложь, Истина);
	ОткрытьФормуМодально("Справочник.Заболевания.Форма.ФормаПодбора", СтруктураПараметров, Элементы.ПризнакиБолезни);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборВозбудителей(Команда)
	СтруктураПараметров = Новый Структура("ВидНазначения, ЗакрыватьПриВыборе, МножественныйВыбор", 
	"ВозбудителиБолезни", Ложь, Истина);
	ОткрытьФормуМодально("Справочник.Заболевания.Форма.ФормаПодбора", СтруктураПараметров, Элементы.ВозбудителиБолезни);
КонецПроцедуры

&НаКлиенте
Процедура ПодборПереносчиков(Команда)
	СтруктураПараметров = Новый Структура("ВидНазначения, ЗакрыватьПриВыборе, МножественныйВыбор", 
	"ПереносчикиБолезни", Ложь, Истина);
	ОткрытьФормуМодально("Справочник.Заболевания.Форма.ФормаПодбора", СтруктураПараметров, Элементы.ПереносчикиБолезни);
КонецПроцедуры

&НаКлиенте
Процедура ПодборЛитературы(Команда)
	СтруктураПараметров = Новый Структура("ВидНазначения, ЗакрыватьПриВыборе, МножественныйВыбор", 
	"Литература", Ложь, Истина);
	ОткрытьФормуМодально("Справочник.Заболевания.Форма.ФормаПодбора", СтруктураПараметров, Элементы.Литература);
КонецПроцедуры

&НаКлиенте
Процедура ПодборВетеринарныхМероприятий(Команда)
	СтруктураПараметров = Новый Структура("ВидНазначения, ЗакрыватьПриВыборе, МножественныйВыбор", 
	"ВетеринарныеМероприятия", Ложь, Истина);
	ОткрытьФормуМодально("Справочник.Заболевания.Форма.ФормаПодбора", СтруктураПараметров, Элементы.ВетеринарныеМероприятия);
КонецПроцедуры

#КонецОбласти
